Tekla Open API Reference for Tekla Structures 2025
RebarHookData.Angle Property
 The angle of the hook. The value is between -270 to +270 degrees.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Angle { get; set; }
Public Property Angle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarHookData Class
Tekla.Structures.Model Namespace